; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	satellite5 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared3 - mode
	thermograph2 - mode
	image0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet13)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument6 satellite5)
	(on_board instrument7 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star0)
)
(:goal (and
	(pointing satellite3 Star14)
	(pointing satellite4 Star14)
	(pointing satellite5 GroundStation2)
	(have_image Phenomenon6 image0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 infrared3)
	(have_image Star9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Star11 image0)
	(have_image Phenomenon12 infrared3)
	(have_image Planet13 image0)
	(have_image Star14 thermograph1)
))

)

; plan
1. (turn_to satellite4 star14 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 star14)
   goals met: 1 of 12
2. (turn_to satellite3 star14 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star14)
   goals met: 2 of 12
3. (turn_to satellite1 groundstation5 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 groundstation5)
   goals met: 2 of 12
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 12
5. (calibrate satellite1 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 2 of 12
6. (turn_to satellite1 planet10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet10)
   goals met: 2 of 12
7. (take_image satellite1 planet10 instrument2 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 3 of 12
8. (turn_to satellite1 phenomenon6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 12
9. (take_image satellite1 phenomenon6 instrument2 image0)
   added: (have_image phenomenon6 image0)
   goals met: 4 of 12
10. (turn_to satellite1 phenomenon12 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 12
11. (take_image satellite1 phenomenon12 instrument2 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 5 of 12
12. (turn_to satellite1 planet13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet13)
   goals met: 5 of 12
13. (take_image satellite1 planet13 instrument2 image0)
   added: (have_image planet13 image0)
   goals met: 6 of 12
14. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 6 of 12
15. (take_image satellite1 planet7 instrument2 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 7 of 12
16. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 7 of 12
17. (take_image satellite1 planet8 instrument2 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 8 of 12
18. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 8 of 12
19. (take_image satellite1 star11 instrument2 image0)
   added: (have_image star11 image0)
   goals met: 9 of 12
20. (turn_to satellite1 star14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star14)
   goals met: 9 of 12
21. (take_image satellite1 star14 instrument2 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 10 of 12
22. (turn_to satellite1 star9 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
23. (take_image satellite1 star9 instrument2 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 11 of 12
24. (turn_to satellite5 groundstation2 star0)
   deleted: (pointing satellite5 star0)
   added: (pointing satellite5 groundstation2)
   goals met: 12 of 12
